package huawei.real.score100;

/**
 * 一条笔直的公路上安装了N个路灯，从位置0开始安装，路灯之间的距离是100m。每个路灯都有自己的照明半径，请计算第一个路灯和最后一个路灯之间，未照明区间的长度和。
 * 输入描述：
 * 第一行为一个数N，表示灯的个数，[1, 100000]
 * 第二行为N个","分隔的数，表示路灯的照明半径，[1, 100*100000]
 * 输出描述：
 * 第一个路灯和最后一个路灯之间，未照明区间的长度和
 * 举例：
 * 输入:
 * 8
 * 10,10 ,10 ,10 ,10 ,10 ,10 ,10
 * 输出：
 * 560
 * 输入：
 * 6
 * 50,20,60,120,30,230
 * 输出：
 * 50
 *
 *
 * ————————————————
 * 版权声明：本文为CSDN博主「听，海啸的声音」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。
 * 原文链接：https://blog.csdn.net/weixin_45201459/article/details/126047209
 */
public class 路灯照明问题 {
}
